app/controllers/users_controller.rb

  def create
	@user = User.new(user_params)
	if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 25 Feb 2014 21:32:27 UTC +00:00], ["email", "bkaancelen@gmail.com"], ["name", "Kaan Celen"], ["updated_at", Tue, 25 Feb 2014 21:32:27 UTC +00:00]]

  def index
	@users = User.paginate(page: params[:page],per_page: 10)
---
SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "users"

  def update
	@user = User.find(params[:id])
	if @user.update_attributes(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["email", "bkaancelen@outlook.com"], ["updated_at", Sun, 09 Mar 2014 13:36:45 UTC +00:00]]